# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
dict = {'1': 'a', '2':'b', '3':'c'}#.....
a = input()
print(dict.get(a))